zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K342_EMAC.h
/** Number of instances of the EMAC module. */
#define EMAC_INSTANCE_COUNT                      (1u)

/* EMAC - Peripheral instance base addresses */
/** Peripheral EMAC base address */
#define IP_EMAC_BASE                             (0x40480000u)
/** Peripheral EMAC base pointer */
#define IP_EMAC                                  ((EMAC_Type *)IP_EMAC_BASE)
/** Array initializer of EMAC peripheral base addresses */
#define IP_EMAC_BASE_ADDRS                       { IP_EMAC_BASE }
/** Array initializer of EMAC peripheral base pointers */
#define IP_EMAC_BASE_PTRS                        { IP_EMAC }

/* ----------------------------------------------------------------------------
   -- EMAC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EMAC_Register_Masks EMAC Register Masks
 * @{
 */

/*! @name MAC_CONFIGURATION - MAC Configuration */
/*! @{ */

#define EMAC_MAC_CONFIGURATION_RE_MASK           (0x1U)
#define EMAC_MAC_CONFIGURATION_RE_SHIFT          (0U)
#define EMAC_MAC_CONFIGURATION_RE_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_RE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_RE_SHIFT)) & EMAC_MAC_CONFIGURATION_RE_MASK)

#define EMAC_MAC_CONFIGURATION_TE_MASK           (0x2U)
#define EMAC_MAC_CONFIGURATION_TE_SHIFT          (1U)
#define EMAC_MAC_CONFIGURATION_TE_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_TE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_TE_SHIFT)) & EMAC_MAC_CONFIGURATION_TE_MASK)

#define EMAC_MAC_CONFIGURATION_PRELEN_MASK       (0xCU)
#define EMAC_MAC_CONFIGURATION_PRELEN_SHIFT      (2U)
#define EMAC_MAC_CONFIGURATION_PRELEN_WIDTH      (2U)
#define EMAC_MAC_CONFIGURATION_PRELEN(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_PRELEN_SHIFT)) & EMAC_MAC_CONFIGURATION_PRELEN_MASK)

#define EMAC_MAC_CONFIGURATION_DC_MASK           (0x10U)
#define EMAC_MAC_CONFIGURATION_DC_SHIFT          (4U)
#define EMAC_MAC_CONFIGURATION_DC_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_DC(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_DC_SHIFT)) & EMAC_MAC_CONFIGURATION_DC_MASK)

#define EMAC_MAC_CONFIGURATION_BL_MASK           (0x60U)
#define EMAC_MAC_CONFIGURATION_BL_SHIFT          (5U)
#define EMAC_MAC_CONFIGURATION_BL_WIDTH          (2U)
#define EMAC_MAC_CONFIGURATION_BL(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_BL_SHIFT)) & EMAC_MAC_CONFIGURATION_BL_MASK)

#define EMAC_MAC_CONFIGURATION_DR_MASK           (0x100U)
#define EMAC_MAC_CONFIGURATION_DR_SHIFT          (8U)
#define EMAC_MAC_CONFIGURATION_DR_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_DR(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_DR_SHIFT)) & EMAC_MAC_CONFIGURATION_DR_MASK)

#define EMAC_MAC_CONFIGURATION_DCRS_MASK         (0x200U)
#define EMAC_MAC_CONFIGURATION_DCRS_SHIFT        (9U)
#define EMAC_MAC_CONFIGURATION_DCRS_WIDTH        (1U)
#define EMAC_MAC_CONFIGURATION_DCRS(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_DCRS_SHIFT)) & EMAC_MAC_CONFIGURATION_DCRS_MASK)

#define EMAC_MAC_CONFIGURATION_DO_MASK           (0x400U)
#define EMAC_MAC_CONFIGURATION_DO_SHIFT          (10U)
#define EMAC_MAC_CONFIGURATION_DO_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_DO(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_DO_SHIFT)) & EMAC_MAC_CONFIGURATION_DO_MASK)

#define EMAC_MAC_CONFIGURATION_ECRSFD_MASK       (0x800U)
#define EMAC_MAC_CONFIGURATION_ECRSFD_SHIFT      (11U)
#define EMAC_MAC_CONFIGURATION_ECRSFD_WIDTH      (1U)
#define EMAC_MAC_CONFIGURATION_ECRSFD(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_ECRSFD_SHIFT)) & EMAC_MAC_CONFIGURATION_ECRSFD_MASK)

#define EMAC_MAC_CONFIGURATION_LM_MASK           (0x1000U)
#define EMAC_MAC_CONFIGURATION_LM_SHIFT          (12U)
#define EMAC_MAC_CONFIGURATION_LM_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_LM(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_LM_SHIFT)) & EMAC_MAC_CONFIGURATION_LM_MASK)

#define EMAC_MAC_CONFIGURATION_DM_MASK           (0x2000U)
#define EMAC_MAC_CONFIGURATION_DM_SHIFT          (13U)
#define EMAC_MAC_CONFIGURATION_DM_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_DM(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_DM_SHIFT)) & EMAC_MAC_CONFIGURATION_DM_MASK)

#define EMAC_MAC_CONFIGURATION_FES_MASK          (0x4000U)
#define EMAC_MAC_CONFIGURATION_FES_SHIFT         (14U)
#define EMAC_MAC_CONFIGURATION_FES_WIDTH         (1U)
#define EMAC_MAC_CONFIGURATION_FES(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_FES_SHIFT)) & EMAC_MAC_CONFIGURATION_FES_MASK)

#define EMAC_MAC_CONFIGURATION_PS_MASK           (0x8000U)
#define EMAC_MAC_CONFIGURATION_PS_SHIFT          (15U)
#define EMAC_MAC_CONFIGURATION_PS_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_PS(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_PS_SHIFT)) & EMAC_MAC_CONFIGURATION_PS_MASK)

#define EMAC_MAC_CONFIGURATION_JE_MASK           (0x10000U)
#define EMAC_MAC_CONFIGURATION_JE_SHIFT          (16U)
#define EMAC_MAC_CONFIGURATION_JE_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_JE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_JE_SHIFT)) & EMAC_MAC_CONFIGURATION_JE_MASK)

#define EMAC_MAC_CONFIGURATION_JD_MASK           (0x20000U)
#define EMAC_MAC_CONFIGURATION_JD_SHIFT          (17U)
#define EMAC_MAC_CONFIGURATION_JD_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_JD(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_JD_SHIFT)) & EMAC_MAC_CONFIGURATION_JD_MASK)

#define EMAC_MAC_CONFIGURATION_WD_MASK           (0x80000U)
#define EMAC_MAC_CONFIGURATION_WD_SHIFT          (19U)
#define EMAC_MAC_CONFIGURATION_WD_WIDTH          (1U)
#define EMAC_MAC_CONFIGURATION_WD(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_WD_SHIFT)) & EMAC_MAC_CONFIGURATION_WD_MASK)

#define EMAC_MAC_CONFIGURATION_ACS_MASK          (0x100000U)
#define EMAC_MAC_CONFIGURATION_ACS_SHIFT         (20U)
#define EMAC_MAC_CONFIGURATION_ACS_WIDTH         (1U)
#define EMAC_MAC_CONFIGURATION_ACS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_ACS_SHIFT)) & EMAC_MAC_CONFIGURATION_ACS_MASK)

